app/controllers/v1/categories_controller.rb

    def create
      @category = Category.new(category_params)

      respond_to do |format|
        if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Real-Time Strategy', '2018-04-05 18:48:15', '2018-04-05 18:48:15')

    def update
      respond_to do |format|
        if @category.update(category_params)
---
UPDATE `categories` SET `name` = 'Action adventure', `updated_at` = '2018-04-05 20:32:03' WHERE `categories`.`id` = 1