app/controllers/v1/games_controller.rb

    def index
      @games = Game.all
---
SELECT `games`.* FROM `games`

    def create
      @game = Game.new(game_params)

      respond_to do |format|
        if @game.save
---
INSERT INTO `games` (`category_id`, `title`, `description`, `author`, `created_at`, `updated_at`) VALUES (14, 'Starcraft 2', 'More Starcraft than ever before', 'David Kim', '2018-04-05 22:56:12', '2018-04-05 22:56:12')

    def update
      respond_to do |format|
        if @game.update(game_params)
---
UPDATE `games` SET `description` = '', `author` = '', `status` = 1, `updated_at` = '2018-04-06 22:28:36' WHERE `games`.`id` = 5

    def destroy
      @game.destroy
---
DELETE FROM `games` WHERE `games`.`id` = 9

    def find_by_category
      @games = Game.where(category_id: params[:category_id])
---
SELECT `games`.* FROM `games` WHERE (title like '%as%' AND category_id = '980190970')

    def search
      category_id = params[:category_id]

      if category_id.blank?
        @games = Game.where("title like ?", "%#{params[:title]}%")
---
SELECT `games`.* FROM `games` WHERE (title like '%Super%')

      def set_game
        @game = Game.find(params[:id])
---
SELECT  `games`.* FROM `games` WHERE `games`.`id` = 22 LIMIT 1